rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    if (!params.has_key?(:director))
      movie_name = Movie.find(params[:id]).title
      flash[:warning] = "#{movie_name} has no director info"
      redirect_to movies_path and return
    end

    @movies = Movie.where(director: params[:director])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Bob"]]